# ConnectionPoint

ConnectedDesignMemeber

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.connection_point import ConnectionPoint

# TODO update the JSON string below
json = "{}"
# create an instance of ConnectionPoint from a JSON string
connection_point_instance = ConnectionPoint.from_json(json)
# print the JSON string representation of the object
print(ConnectionPoint.to_json())

# convert the object into a dict
connection_point_dict = connection_point_instance.to_dict()
# create an instance of ConnectionPoint from a dict
connection_point_from_dict = ConnectionPoint.from_dict(connection_point_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)